


backbone:
  # [from, repeats, module, args]
backbone:
  - [-1, 1, ConvNormLayer, [24, 3, 2, None, False, 'relu']]  # 32→24
  - [-1, 1, ConvNormLayer, [24, 3, 1, None, False, 'relu']]
  - [-1, 1, ConvNormLayer, [48, 3, 1, None, False, 'relu']]  # 64→48
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]]

  - [-1, 1, Blocks, [48,   BasicBlock, 2, 2, 'relu']]  # 64→48
  - [-1, 1, Blocks, [96,   BasicBlock, 2, 3, 'relu']]  # 128→96
  - [-1, 1, Blocks, [192,  BasicBlock, 2, 4, 'relu']]  # 256→192
  - [-1, 1, Blocks, [384,  BasicBlock, 2, 5, 'relu']]  # 512→384

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 8 input_proj.2
  - [-1, 1, AIFI, [1024, 8]] # 9
  - [-1, 1, Conv, [256, 1, 1]]  # 10, Y5, lateral_convs.0

  - [-1, 1, DGF, []] # 11
  - [-1, 1, nn.Conv2d, [256, 1]] # 12
  - [-1, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1]] # 13

  - [6, 1, DGF, []] # 14
  - [-1, 1, nn.Conv2d, [256, 1]] # 15
  - [13, 1, DGF, [False]] # 16
  - [[-1, -2], 1, Multiply, []] # 17
  - [[-1, 13], 1, Add, []] # 18
  - [-1, 3, RepC3, [256, 0.5]] # 19 P4/16

  - [13, 1, nn.ConvTranspose2d, [256, 3, 2, 1, 1, 16]] # 20
  - [5, 1, DGF, []] # 21
  - [-1, 1, nn.Conv2d, [256, 1]] # 22
  - [20, 1, DGF, [False]] # 23
  - [[-1, -2], 1, Multiply, []] # 24
  - [[-1, 20], 1, Add, []] # 25
  - [-1, 3, RepC3, [256, 0.5]] # 26 P3/8

  - [[26, 19, 12], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
